Revit 2024 API
BasicLossFactor Class
 This class encapsulates basic lighting loss factor calculation.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class BasicLossFactor : LossFactor
Visual Basic
Public Class BasicLossFactor _
	Inherits LossFactor
Visual C++
public ref class BasicLossFactor : public LossFactor
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.LossFactor
 Autodesk.Revit.DB.Lighting.BasicLossFactor
See Also
BasicLossFactor Members
Autodesk.Revit.DB.Lighting Namespace